---
title: "Cant compile kernel on 7.04"
date: 2008-09-06
forum: General Help
---

### Post by roberth_001 on 2008-09-06
Im running on 2.6.22.14 by the way.

Im following [this guide](http://www.howtoforge.com/creating-the-sis191-gigabit-ethernet-driver-on-linux-2.6) so that i can enable the ethernet port on my laptop, which supposedly worked out of the box, but not for me. 

Anyway, i get to the point where it tells me to run > make oldconfig

I change directory to where my kernel is extracted to (\home\me\linuz-2.6.22.14\) and run the command, and i generate a huge list of errors instead of something useful
> rob@rob-laptop:~$ cd /home/rob/linux-2.6.22.14
rob@rob-laptop:~/linux-2.6.22.14$ make oldconfig
HOSTCC scripts/basic/fixdep
scripts/basic/fixdep.c:107:23: error: sys/types.h: No such file or directory
scripts/basic/fixdep.c:108:22: error: sys/stat.h: No such file or directory
scripts/basic/fixdep.c:109:22: error: sys/mman.h: No such file or directory
scripts/basic/fixdep.c:110:20: error: unistd.h: No such file or directory
scripts/basic/fixdep.c:111:19: error: fcntl.h: No such file or directory
scripts/basic/fixdep.c:112:20: error: string.h: No such file or directory
scripts/basic/fixdep.c:113:20: error: stdlib.h: No such file or directory
scripts/basic/fixdep.c:114:19: error: stdio.h: No such file or directory
In file included from /usr/lib/gcc/i486-linux-gnu/4.1.3/include/syslimits.h:7,
from /usr/lib/gcc/i486-linux-gnu/4.1.3/include/limits.h:11,
from scripts/basic/fixdep.c:115:
/usr/lib/gcc/i486-linux-gnu/4.1.3/include/limits.h:122:61: error: limits.h: No such file or directory
scripts/basic/fixdep.c:116:19: error: ctype.h: No such file or directory
scripts/basic/fixdep.c:117:23: error: arpa/inet.h: No such file or directory
scripts/basic/fixdep.c: In function Гўв‚¬ЛњusageГўв‚¬в„ў:
scripts/basic/fixdep.c:131: warning: implicit declaration of function Гўв‚¬ЛњfprintfГўв‚¬в„ў
scripts/basic/fixdep.c:131: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњfprintfГўв‚¬в„ў
scripts/basic/fixdep.c:131: error: Гўв‚¬ЛњstderrГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:131: error: (Each undeclared identifier is reported only once
scripts/basic/fixdep.c:131: error: for each function it appears in.)
scripts/basic/fixdep.c:132: warning: implicit declaration of function Гўв‚¬ЛњexitГўв‚¬в„ў
scripts/basic/fixdep.c:132: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњexitГўв‚¬в„ў
scripts/basic/fixdep.c: In function Гўв‚¬Лњprint_cmdlineГўв‚¬в„ў:
scripts/basic/fixdep.c:140: warning: implicit declaration of function Гўв‚¬ЛњprintfГўв‚¬в„ў
scripts/basic/fixdep.c:140: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњprintfГўв‚¬в„ў
scripts/basic/fixdep.c: At top level:
scripts/basic/fixdep.c:143: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared here (not in a function)
scripts/basic/fixdep.c: In function Гўв‚¬Лњgrow_configГўв‚¬в„ў:
scripts/basic/fixdep.c:156: warning: implicit declaration of function Гўв‚¬ЛњreallocГўв‚¬в„ў
scripts/basic/fixdep.c:156: warning: assignment makes pointer from integer without a cast
scripts/basic/fixdep.c:158: warning: implicit declaration of function Гўв‚¬ЛњperrorГўв‚¬в„ў
scripts/basic/fixdep.c:158: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњexitГўв‚¬в„ў
scripts/basic/fixdep.c: In function Гўв‚¬Лњis_defined_configГўв‚¬в„ў:
scripts/basic/fixdep.c:174: warning: implicit declaration of function Гўв‚¬ЛњmemcmpГўв‚¬в„ў
scripts/basic/fixdep.c: In function Гўв‚¬Лњdefine_configГўв‚¬в„ў:
scripts/basic/fixdep.c:187: warning: implicit declaration of function Гўв‚¬ЛњmemcpyГўв‚¬в„ў
scripts/basic/fixdep.c:187: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњmemcpyГўв‚¬в„ў
scripts/basic/fixdep.c: In function Гўв‚¬Лњuse_configГўв‚¬в„ў:
scripts/basic/fixdep.c:206: error: Гўв‚¬ЛњPATH_MAXГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:214: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњmemcpyГўв‚¬в„ў
scripts/basic/fixdep.c:220: warning: implicit declaration of function Гўв‚¬ЛњtolowerГўв‚¬в„ў
scripts/basic/fixdep.c:222: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњprintfГўв‚¬в„ў
scripts/basic/fixdep.c:206: warning: unused variable Гўв‚¬ЛњsГўв‚¬в„ў
scripts/basic/fixdep.c: At top level:
scripts/basic/fixdep.c:225: error: expected declaration specifiers or Гўв‚¬Лњ...Гўв‚¬в„ў before Гўв‚¬Лњsize_tГўв‚¬в„ў
scripts/basic/fixdep.c: In function Гўв‚¬Лњparse_config_fileГўв‚¬в„ў:
scripts/basic/fixdep.c:227: error: Гўв‚¬ЛњlenГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:233: warning: implicit declaration of function Гўв‚¬ЛњntohlГўв‚¬в„ў
scripts/basic/fixdep.c:244: warning: implicit declaration of function Гўв‚¬ЛњisalnumГўв‚¬в„ў
scripts/basic/fixdep.c: In function Гўв‚¬ЛњstrrcmpГўв‚¬в„ў:
scripts/basic/fixdep.c:261: warning: implicit declaration of function Гўв‚¬ЛњstrlenГўв‚¬в„ў
scripts/basic/fixdep.c:261: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrlenГўв‚¬в„ў
scripts/basic/fixdep.c: In function Гўв‚¬Лњdo_config_fileГўв‚¬в„ў:
scripts/basic/fixdep.c:272: error: storage size of Гўв‚¬ЛњstГўв‚¬в„ў isnГўв‚¬в„ўt known
scripts/basic/fixdep.c:276: warning: implicit declaration of function Гўв‚¬ЛњopenГўв‚¬в„ў
scripts/basic/fixdep.c:276: error: Гўв‚¬ЛњO_RDONLYГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:278: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњfprintfГўв‚¬в„ў
scripts/basic/fixdep.c:278: error: Гўв‚¬ЛњstderrГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:280: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњexitГўв‚¬в„ў
scripts/basic/fixdep.c:282: warning: implicit declaration of function Гўв‚¬ЛњfstatГўв‚¬в„ў
scripts/basic/fixdep.c:284: warning: implicit declaration of function Гўв‚¬ЛњcloseГўв‚¬в„ў
scripts/basic/fixdep.c:287: warning: implicit declaration of function Гўв‚¬ЛњmmapГўв‚¬в„ў
scripts/basic/fixdep.c:287: error: Гўв‚¬ЛњPROT_READГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:287: error: Гўв‚¬ЛњMAP_PRIVATEГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:287: warning: assignment makes pointer from integer without a cast
scripts/basic/fixdep.c:294: error: too many arguments to function Гўв‚¬Лњparse_config_fileГўв‚¬в„ў
scripts/basic/fixdep.c:296: warning: implicit declaration of function Гўв‚¬ЛњmunmapГўв‚¬в„ў
scripts/basic/fixdep.c:272: warning: unused variable Гўв‚¬ЛњstГўв‚¬в„ў
scripts/basic/fixdep.c: At top level:
scripts/basic/fixdep.c:301: error: expected declaration specifiers or Гўв‚¬Лњ...Гўв‚¬в„ў before Гўв‚¬Лњsize_tГўв‚¬в„ў
scripts/basic/fixdep.c: In function Гўв‚¬Лњparse_dep_fileГўв‚¬в„ў:
scripts/basic/fixdep.c:304: error: Гўв‚¬ЛњlenГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:306: error: Гўв‚¬ЛњPATH_MAXГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:308: warning: implicit declaration of function Гўв‚¬ЛњstrchrГўв‚¬в„ў
scripts/basic/fixdep.c:308: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrchrГўв‚¬в„ў
scripts/basic/fixdep.c:310: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњfprintfГўв‚¬в„ў
scripts/basic/fixdep.c:310: error: Гўв‚¬ЛњstderrГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:311: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњexitГўв‚¬в„ў
scripts/basic/fixdep.c:313: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњmemcpyГўв‚¬в„ў
scripts/basic/fixdep.c:314: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњprintfГўв‚¬в„ў
scripts/basic/fixdep.c:306: warning: unused variable Гўв‚¬ЛњsГўв‚¬в„ў
scripts/basic/fixdep.c: In function Гўв‚¬Лњprint_depsГўв‚¬в„ў:
scripts/basic/fixdep.c:343: error: storage size of Гўв‚¬ЛњstГўв‚¬в„ў isnГўв‚¬в„ўt known
scripts/basic/fixdep.c:347: error: Гўв‚¬ЛњO_RDONLYГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:349: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњfprintfГўв‚¬в„ў
scripts/basic/fixdep.c:349: error: Гўв‚¬ЛњstderrГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:351: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњexitГўв‚¬в„ў
scripts/basic/fixdep.c:355: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњfprintfГўв‚¬в„ў
scripts/basic/fixdep.c:359: error: Гўв‚¬ЛњPROT_READГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:359: error: Гўв‚¬ЛњMAP_PRIVATEГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:359: warning: assignment makes pointer from integer without a cast
scripts/basic/fixdep.c:366: error: too many arguments to function Гўв‚¬Лњparse_dep_fileГўв‚¬в„ў
scripts/basic/fixdep.c:343: warning: unused variable Гўв‚¬ЛњstГўв‚¬в„ў
scripts/basic/fixdep.c: In function Гўв‚¬ЛњtrapsГўв‚¬в„ў:
scripts/basic/fixdep.c:378: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњfprintfГўв‚¬в„ў
scripts/basic/fixdep.c:378: error: Гўв‚¬ЛњstderrГўв‚¬в„ў undeclared (first use in this function)
scripts/basic/fixdep.c:380: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњexitГўв‚¬в„ў
make[1]: *** [scripts/basic/fixdep] Error 1
make: *** [scripts_basic] Error 2
rob@rob-laptop:~/linux-2.6.22.14$ 

Anyone know where ive gone wrong. Thanks in advance

---

### Post by Washer on 2008-09-06
try "make xconfig" or "make menuconfig." I've only ever used menuconfig, but i'm 90% sure it imports the current config file from the kernel you booted into. 

If you're paranoid, you can manually copy it from /boot/config-urkernel to the folder & rename it as ".config".

Oh, btw stop using 7.04 thx

---

### Post by Washer on 2008-09-06
[http://ubuntuforums.org/showthread.php?t=311158](http://ubuntuforums.org/showthread.php?t=311158)
[http://linuxhelp.150m.com/installs/compile-kernel.htm](http://linuxhelp.150m.com/installs/compile-kernel.htm)

I used those two guides while compiling other stuff. Maybe you can compare notes see what's different.

---

### Post by roberth_001 on 2008-09-06
> **Washer said:**
> try "make xconfig" or "make menuconfig." I've only ever used menuconfig, but i'm 90% sure it imports the current config file from the kernel you booted into. 

If you're paranoid, you can manually copy it from /boot/config-urkernel to the folder & rename it as ".config".

Oh, btw stop using 7.04 thx

why. 7.04 is fine for me, all i want it for is a replacement for vista, which is slow on my laptop for web browsing


Thanks for the advice though, will try it

---

